package javaStandard;

public class ObjectLang {
    public static void main(String[] args) {
        // 객체지향언어 (Object Oriented Programming) 
        // 코드의 재사용성이 높고 유지보수가 용이, 중복코드제거
        // 1. 캡슐화, 2. 상속, 3.추상화, 4.다형성

        // 클래스와 객체
        // 클래스란 - 제품 설계도, TV 설계도, 붕어빵 기계
        // 클래스의 정의 - 객체를 정의
        // 클래스의 용도 - 클래스는 객체를 생성하는데 사용

        // 객체란 - 제품, TV, 붕어빵
        // 객체의 정의 - 실제로 존재하는 것. 사물 or 개념
        // 객체의 용도 - 객체가 가지고 있는 기능과 속성

        // 객체 = 속성(변수) + 기능(메서드)
        // 속성에는 크기, 길이, 높이, 색상 등
        // 기능에는 켜기 끄기 볼륨 높이기

        // 객체 -> 모든 인스턴스를 대표하는 일반적 용어
        // 인스턴스 -> 특정 클래스로부터 생성된 객체

        // 클래스가 왜 필요한가?
        // 객체를 생성하기 위해

        // 객체가 왜 필요한가?
        // 객체를 사용하기 위해

        // 객체를 사용한다는 것은?
        // 객체가 가진 속성과 기능을 사용하려고
    


    }
}
